RT-Thread/rt-thread/bsp/freescale/platform/devices/MK51D10/include/MK51D10_extension.h
/*! @brief Set the HRS9 field to a new value. */
#define DMA_WR_HRS_HRS9(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS9_MASK, DMA_HRS_HRS9(value)))
#define DMA_BWR_HRS_HRS9(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS9_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS10[10] (RW)
 *
 * Values:
 * - 0b0 - A hardware service request for the corresponding channel is not
 *     present
 * - 0b1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS10 field. */
#define DMA_RD_HRS_HRS10(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS10_MASK) >> DMA_HRS_HRS10_SHIFT)
#define DMA_BRD_HRS_HRS10(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS10_SHIFT))

/*! @brief Set the HRS10 field to a new value. */
#define DMA_WR_HRS_HRS10(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS10_MASK, DMA_HRS_HRS10(value)))
#define DMA_BWR_HRS_HRS10(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS10_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS11[11] (RW)
 *
 * Values:
 * - 0b0 - A hardware service request for the corresponding channel is not
 *     present
 * - 0b1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS11 field. */
#define DMA_RD_HRS_HRS11(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS11_MASK) >> DMA_HRS_HRS11_SHIFT)
#define DMA_BRD_HRS_HRS11(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS11_SHIFT))

/*! @brief Set the HRS11 field to a new value. */
#define DMA_WR_HRS_HRS11(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS11_MASK, DMA_HRS_HRS11(value)))
#define DMA_BWR_HRS_HRS11(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS11_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS12[12] (RW)
 *
 * Values:
 * - 0b0 - A hardware service request for the corresponding channel is not
 *     present
 * - 0b1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS12 field. */
#define DMA_RD_HRS_HRS12(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS12_MASK) >> DMA_HRS_HRS12_SHIFT)
#define DMA_BRD_HRS_HRS12(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS12_SHIFT))

/*! @brief Set the HRS12 field to a new value. */
#define DMA_WR_HRS_HRS12(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS12_MASK, DMA_HRS_HRS12(value)))
#define DMA_BWR_HRS_HRS12(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS12_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS13[13] (RW)
 *
 * Values:
 * - 0b0 - A hardware service request for the corresponding channel is not
 *     present
 * - 0b1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS13 field. */
#define DMA_RD_HRS_HRS13(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS13_MASK) >> DMA_HRS_HRS13_SHIFT)
#define DMA_BRD_HRS_HRS13(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS13_SHIFT))

/*! @brief Set the HRS13 field to a new value. */
#define DMA_WR_HRS_HRS13(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS13_MASK, DMA_HRS_HRS13(value)))
#define DMA_BWR_HRS_HRS13(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS13_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS14[14] (RW)
 *
 * Values:
 * - 0b0 - A hardware service request for the corresponding channel is not
 *     present
 * - 0b1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS14 field. */
#define DMA_RD_HRS_HRS14(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS14_MASK) >> DMA_HRS_HRS14_SHIFT)
#define DMA_BRD_HRS_HRS14(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS14_SHIFT))

/*! @brief Set the HRS14 field to a new value. */
#define DMA_WR_HRS_HRS14(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS14_MASK, DMA_HRS_HRS14(value)))
#define DMA_BWR_HRS_HRS14(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS14_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS15[15] (RW)
 *
 * Values:
 * - 0b0 - A hardware service request for the corresponding channel is not
 *     present
 * - 0b1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS15 field. */
#define DMA_RD_HRS_HRS15(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS15_MASK) >> DMA_HRS_HRS15_SHIFT)
#define DMA_BRD_HRS_HRS15(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS15_SHIFT))

/*! @brief Set the HRS15 field to a new value. */
#define DMA_WR_HRS_HRS15(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS15_MASK, DMA_HRS_HRS15(value)))
#define DMA_BWR_HRS_HRS15(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS15_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI3 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI3 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel . The channel priorities are evaluated by numeric value; for example, 0 is
 * the lowest priority, 1 is the next priority, then 2, 3, etc. Software must
 * program the channel priorities with unique values; otherwise, a configuration
 * error is reported. The range of the priority value is limited to the values of 0
 * through 15 .
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI3 register
 */
/*@{*/
#define DMA_RD_DCHPRI3(base)     (DMA_DCHPRI3_REG(base))
#define DMA_WR_DCHPRI3(base, value) (DMA_DCHPRI3_REG(base) = (value))
#define DMA_RMW_DCHPRI3(base, mask, value) (DMA_WR_DCHPRI3(base, (DMA_RD_DCHPRI3(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI3(base, value) (DMA_WR_DCHPRI3(base, DMA_RD_DCHPRI3(base) |  (value)))
#define DMA_CLR_DCHPRI3(base, value) (DMA_WR_DCHPRI3(base, DMA_RD_DCHPRI3(base) & ~(value)))
#define DMA_TOG_DCHPRI3(base, value) (DMA_WR_DCHPRI3(base, DMA_RD_DCHPRI3(base) ^  (value)))
/*@}*/

