RT-Thread/rt-thread/bsp/freescale/platform/devices/MK51D10/include/MK51D10_extension.h
/*! @brief Set the BPALCD12 field to a new value. */
#define LCD_WR_WF8B_BPALCD12(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD12_MASK, LCD_WF8B_BPALCD12(value)))
#define LCD_BWR_WF8B_BPALCD12(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD12_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD11[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD11 field. */
#define LCD_RD_WF8B_BPALCD11(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD11_MASK) >> LCD_WF8B_BPALCD11_SHIFT)
#define LCD_BRD_WF8B_BPALCD11(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD11_SHIFT))

/*! @brief Set the BPALCD11 field to a new value. */
#define LCD_WR_WF8B_BPALCD11(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD11_MASK, LCD_WF8B_BPALCD11(value)))
#define LCD_BWR_WF8B_BPALCD11(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD11_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD10[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD10 field. */
#define LCD_RD_WF8B_BPALCD10(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD10_MASK) >> LCD_WF8B_BPALCD10_SHIFT)
#define LCD_BRD_WF8B_BPALCD10(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD10_SHIFT))

/*! @brief Set the BPALCD10 field to a new value. */
#define LCD_WR_WF8B_BPALCD10(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD10_MASK, LCD_WF8B_BPALCD10(value)))
#define LCD_BWR_WF8B_BPALCD10(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD10_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD9[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD9 field. */
#define LCD_RD_WF8B_BPALCD9(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD9_MASK) >> LCD_WF8B_BPALCD9_SHIFT)
#define LCD_BRD_WF8B_BPALCD9(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD9_SHIFT))

/*! @brief Set the BPALCD9 field to a new value. */
#define LCD_WR_WF8B_BPALCD9(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD9_MASK, LCD_WF8B_BPALCD9(value)))
#define LCD_BWR_WF8B_BPALCD9(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD9_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD8[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD8 field. */
#define LCD_RD_WF8B_BPALCD8(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD8_MASK) >> LCD_WF8B_BPALCD8_SHIFT)
#define LCD_BRD_WF8B_BPALCD8(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD8_SHIFT))

/*! @brief Set the BPALCD8 field to a new value. */
#define LCD_WR_WF8B_BPALCD8(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD8_MASK, LCD_WF8B_BPALCD8(value)))
#define LCD_BWR_WF8B_BPALCD8(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD8_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD1[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD1 field. */
#define LCD_RD_WF8B_BPBLCD1(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD1_MASK) >> LCD_WF8B_BPBLCD1_SHIFT)
#define LCD_BRD_WF8B_BPBLCD1(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD1_SHIFT))

/*! @brief Set the BPBLCD1 field to a new value. */
#define LCD_WR_WF8B_BPBLCD1(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD1_MASK, LCD_WF8B_BPBLCD1(value)))
#define LCD_BWR_WF8B_BPBLCD1(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD32[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD32 field. */
#define LCD_RD_WF8B_BPBLCD32(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD32_MASK) >> LCD_WF8B_BPBLCD32_SHIFT)
#define LCD_BRD_WF8B_BPBLCD32(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD32_SHIFT))

/*! @brief Set the BPBLCD32 field to a new value. */
#define LCD_WR_WF8B_BPBLCD32(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD32_MASK, LCD_WF8B_BPBLCD32(value)))
#define LCD_BWR_WF8B_BPBLCD32(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD32_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD30[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD30 field. */
#define LCD_RD_WF8B_BPBLCD30(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD30_MASK) >> LCD_WF8B_BPBLCD30_SHIFT)
#define LCD_BRD_WF8B_BPBLCD30(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD30_SHIFT))

/*! @brief Set the BPBLCD30 field to a new value. */
#define LCD_WR_WF8B_BPBLCD30(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD30_MASK, LCD_WF8B_BPBLCD30(value)))
#define LCD_BWR_WF8B_BPBLCD30(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD30_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD60[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD60 field. */
#define LCD_RD_WF8B_BPBLCD60(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD60_MASK) >> LCD_WF8B_BPBLCD60_SHIFT)
#define LCD_BRD_WF8B_BPBLCD60(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD60_SHIFT))

/*! @brief Set the BPBLCD60 field to a new value. */
#define LCD_WR_WF8B_BPBLCD60(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD60_MASK, LCD_WF8B_BPBLCD60(value)))
#define LCD_BWR_WF8B_BPBLCD60(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD60_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD24[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD24 field. */
#define LCD_RD_WF8B_BPBLCD24(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD24_MASK) >> LCD_WF8B_BPBLCD24_SHIFT)
#define LCD_BRD_WF8B_BPBLCD24(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD24_SHIFT))

/*! @brief Set the BPBLCD24 field to a new value. */
#define LCD_WR_WF8B_BPBLCD24(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD24_MASK, LCD_WF8B_BPBLCD24(value)))
#define LCD_BWR_WF8B_BPBLCD24(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD24_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD28[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD28 field. */
#define LCD_RD_WF8B_BPBLCD28(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD28_MASK) >> LCD_WF8B_BPBLCD28_SHIFT)
#define LCD_BRD_WF8B_BPBLCD28(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD28_SHIFT))

/*! @brief Set the BPBLCD28 field to a new value. */
#define LCD_WR_WF8B_BPBLCD28(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD28_MASK, LCD_WF8B_BPBLCD28(value)))
#define LCD_BWR_WF8B_BPBLCD28(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD28_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD23[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD23 field. */
#define LCD_RD_WF8B_BPBLCD23(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD23_MASK) >> LCD_WF8B_BPBLCD23_SHIFT)
#define LCD_BRD_WF8B_BPBLCD23(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD23_SHIFT))

/*! @brief Set the BPBLCD23 field to a new value. */
#define LCD_WR_WF8B_BPBLCD23(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD23_MASK, LCD_WF8B_BPBLCD23(value)))
#define LCD_BWR_WF8B_BPBLCD23(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD23_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD48[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD48 field. */
#define LCD_RD_WF8B_BPBLCD48(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD48_MASK) >> LCD_WF8B_BPBLCD48_SHIFT)
#define LCD_BRD_WF8B_BPBLCD48(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD48_SHIFT))

