RT-Thread/rt-thread/bsp/freescale/platform/devices/MK51D10/include/MK51D10_extension.h
/*! @brief Set the BPCLCD58 field to a new value. */
#define LCD_WR_WF8B_BPCLCD58(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD58_MASK, LCD_WF8B_BPCLCD58(value)))
#define LCD_BWR_WF8B_BPCLCD58(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD58_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD41[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD41 field. */
#define LCD_RD_WF8B_BPCLCD41(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD41_MASK) >> LCD_WF8B_BPCLCD41_SHIFT)
#define LCD_BRD_WF8B_BPCLCD41(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD41_SHIFT))

/*! @brief Set the BPCLCD41 field to a new value. */
#define LCD_WR_WF8B_BPCLCD41(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD41_MASK, LCD_WF8B_BPCLCD41(value)))
#define LCD_BWR_WF8B_BPCLCD41(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD41_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD37[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD37 field. */
#define LCD_RD_WF8B_BPCLCD37(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD37_MASK) >> LCD_WF8B_BPCLCD37_SHIFT)
#define LCD_BRD_WF8B_BPCLCD37(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD37_SHIFT))

/*! @brief Set the BPCLCD37 field to a new value. */
#define LCD_WR_WF8B_BPCLCD37(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD37_MASK, LCD_WF8B_BPCLCD37(value)))
#define LCD_BWR_WF8B_BPCLCD37(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD37_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD3[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD3 field. */
#define LCD_RD_WF8B_BPCLCD3(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD3_MASK) >> LCD_WF8B_BPCLCD3_SHIFT)
#define LCD_BRD_WF8B_BPCLCD3(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD3_SHIFT))

/*! @brief Set the BPCLCD3 field to a new value. */
#define LCD_WR_WF8B_BPCLCD3(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD3_MASK, LCD_WF8B_BPCLCD3(value)))
#define LCD_BWR_WF8B_BPCLCD3(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD12[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD12 field. */
#define LCD_RD_WF8B_BPCLCD12(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD12_MASK) >> LCD_WF8B_BPCLCD12_SHIFT)
#define LCD_BRD_WF8B_BPCLCD12(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD12_SHIFT))

/*! @brief Set the BPCLCD12 field to a new value. */
#define LCD_WR_WF8B_BPCLCD12(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD12_MASK, LCD_WF8B_BPCLCD12(value)))
#define LCD_BWR_WF8B_BPCLCD12(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD12_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD11[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD11 field. */
#define LCD_RD_WF8B_BPCLCD11(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD11_MASK) >> LCD_WF8B_BPCLCD11_SHIFT)
#define LCD_BRD_WF8B_BPCLCD11(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD11_SHIFT))

/*! @brief Set the BPCLCD11 field to a new value. */
#define LCD_WR_WF8B_BPCLCD11(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD11_MASK, LCD_WF8B_BPCLCD11(value)))
#define LCD_BWR_WF8B_BPCLCD11(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD11_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD38[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD38 field. */
#define LCD_RD_WF8B_BPCLCD38(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD38_MASK) >> LCD_WF8B_BPCLCD38_SHIFT)
#define LCD_BRD_WF8B_BPCLCD38(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD38_SHIFT))

/*! @brief Set the BPCLCD38 field to a new value. */
#define LCD_WR_WF8B_BPCLCD38(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD38_MASK, LCD_WF8B_BPCLCD38(value)))
#define LCD_BWR_WF8B_BPCLCD38(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD38_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD44[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD44 field. */
#define LCD_RD_WF8B_BPCLCD44(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD44_MASK) >> LCD_WF8B_BPCLCD44_SHIFT)
#define LCD_BRD_WF8B_BPCLCD44(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD44_SHIFT))

/*! @brief Set the BPCLCD44 field to a new value. */
#define LCD_WR_WF8B_BPCLCD44(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD44_MASK, LCD_WF8B_BPCLCD44(value)))
#define LCD_BWR_WF8B_BPCLCD44(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD44_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD31[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD31 field. */
#define LCD_RD_WF8B_BPCLCD31(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD31_MASK) >> LCD_WF8B_BPCLCD31_SHIFT)
#define LCD_BRD_WF8B_BPCLCD31(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD31_SHIFT))

