RT-Thread/rt-thread/bsp/freescale/platform/devices/MK51D10/include/MK51D10_extension.h
/*! @brief Set the BPELCD8 field to a new value. */
#define LCD_WR_WF8B_BPELCD8(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD8_MASK, LCD_WF8B_BPELCD8(value)))
#define LCD_BWR_WF8B_BPELCD8(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD8_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD35[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD35 field. */
#define LCD_RD_WF8B_BPELCD35(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD35_MASK) >> LCD_WF8B_BPELCD35_SHIFT)
#define LCD_BRD_WF8B_BPELCD35(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD35_SHIFT))

/*! @brief Set the BPELCD35 field to a new value. */
#define LCD_WR_WF8B_BPELCD35(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD35_MASK, LCD_WF8B_BPELCD35(value)))
#define LCD_BWR_WF8B_BPELCD35(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD35_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD42[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD42 field. */
#define LCD_RD_WF8B_BPELCD42(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD42_MASK) >> LCD_WF8B_BPELCD42_SHIFT)
#define LCD_BRD_WF8B_BPELCD42(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD42_SHIFT))

/*! @brief Set the BPELCD42 field to a new value. */
#define LCD_WR_WF8B_BPELCD42(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD42_MASK, LCD_WF8B_BPELCD42(value)))
#define LCD_BWR_WF8B_BPELCD42(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD42_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD34[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD34 field. */
#define LCD_RD_WF8B_BPELCD34(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD34_MASK) >> LCD_WF8B_BPELCD34_SHIFT)
#define LCD_BRD_WF8B_BPELCD34(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD34_SHIFT))

/*! @brief Set the BPELCD34 field to a new value. */
#define LCD_WR_WF8B_BPELCD34(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD34_MASK, LCD_WF8B_BPELCD34(value)))
#define LCD_BWR_WF8B_BPELCD34(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD34_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD33[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD33 field. */
#define LCD_RD_WF8B_BPELCD33(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD33_MASK) >> LCD_WF8B_BPELCD33_SHIFT)
#define LCD_BRD_WF8B_BPELCD33(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD33_SHIFT))

/*! @brief Set the BPELCD33 field to a new value. */
#define LCD_WR_WF8B_BPELCD33(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD33_MASK, LCD_WF8B_BPELCD33(value)))
#define LCD_BWR_WF8B_BPELCD33(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD33_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD11[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD11 field. */
#define LCD_RD_WF8B_BPELCD11(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD11_MASK) >> LCD_WF8B_BPELCD11_SHIFT)
#define LCD_BRD_WF8B_BPELCD11(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD11_SHIFT))

/*! @brief Set the BPELCD11 field to a new value. */
#define LCD_WR_WF8B_BPELCD11(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD11_MASK, LCD_WF8B_BPELCD11(value)))
#define LCD_BWR_WF8B_BPELCD11(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD11_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD43[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD43 field. */
#define LCD_RD_WF8B_BPELCD43(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD43_MASK) >> LCD_WF8B_BPELCD43_SHIFT)
#define LCD_BRD_WF8B_BPELCD43(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD43_SHIFT))

/*! @brief Set the BPELCD43 field to a new value. */
#define LCD_WR_WF8B_BPELCD43(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD43_MASK, LCD_WF8B_BPELCD43(value)))
#define LCD_BWR_WF8B_BPELCD43(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD43_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD32[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD32 field. */
#define LCD_RD_WF8B_BPELCD32(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD32_MASK) >> LCD_WF8B_BPELCD32_SHIFT)
#define LCD_BRD_WF8B_BPELCD32(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD32_SHIFT))

/*! @brief Set the BPELCD32 field to a new value. */
#define LCD_WR_WF8B_BPELCD32(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD32_MASK, LCD_WF8B_BPELCD32(value)))
#define LCD_BWR_WF8B_BPELCD32(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD32_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD31[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD31 field. */
#define LCD_RD_WF8B_BPELCD31(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD31_MASK) >> LCD_WF8B_BPELCD31_SHIFT)
#define LCD_BRD_WF8B_BPELCD31(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD31_SHIFT))

/*! @brief Set the BPELCD31 field to a new value. */
#define LCD_WR_WF8B_BPELCD31(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD31_MASK, LCD_WF8B_BPELCD31(value)))
#define LCD_BWR_WF8B_BPELCD31(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD31_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD44[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD44 field. */
#define LCD_RD_WF8B_BPELCD44(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD44_MASK) >> LCD_WF8B_BPELCD44_SHIFT)
#define LCD_BRD_WF8B_BPELCD44(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD44_SHIFT))

/*! @brief Set the BPELCD44 field to a new value. */
#define LCD_WR_WF8B_BPELCD44(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD44_MASK, LCD_WF8B_BPELCD44(value)))
#define LCD_BWR_WF8B_BPELCD44(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD44_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD30[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD30 field. */
#define LCD_RD_WF8B_BPELCD30(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD30_MASK) >> LCD_WF8B_BPELCD30_SHIFT)
#define LCD_BRD_WF8B_BPELCD30(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD30_SHIFT))

/*! @brief Set the BPELCD30 field to a new value. */
#define LCD_WR_WF8B_BPELCD30(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD30_MASK, LCD_WF8B_BPELCD30(value)))
#define LCD_BWR_WF8B_BPELCD30(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD30_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD29[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD29 field. */
#define LCD_RD_WF8B_BPELCD29(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD29_MASK) >> LCD_WF8B_BPELCD29_SHIFT)
#define LCD_BRD_WF8B_BPELCD29(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD29_SHIFT))

/*! @brief Set the BPELCD29 field to a new value. */
#define LCD_WR_WF8B_BPELCD29(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD29_MASK, LCD_WF8B_BPELCD29(value)))
#define LCD_BWR_WF8B_BPELCD29(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD29_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD7[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD7 field. */
#define LCD_RD_WF8B_BPELCD7(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD7_MASK) >> LCD_WF8B_BPELCD7_SHIFT)
#define LCD_BRD_WF8B_BPELCD7(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD7_SHIFT))

/*! @brief Set the BPELCD7 field to a new value. */
#define LCD_WR_WF8B_BPELCD7(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD7_MASK, LCD_WF8B_BPELCD7(value)))
#define LCD_BWR_WF8B_BPELCD7(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD45[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD45 field. */
#define LCD_RD_WF8B_BPELCD45(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD45_MASK) >> LCD_WF8B_BPELCD45_SHIFT)
#define LCD_BRD_WF8B_BPELCD45(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD45_SHIFT))

/*! @brief Set the BPELCD45 field to a new value. */
#define LCD_WR_WF8B_BPELCD45(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD45_MASK, LCD_WF8B_BPELCD45(value)))
#define LCD_BWR_WF8B_BPELCD45(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD45_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD28[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD28 field. */
#define LCD_RD_WF8B_BPELCD28(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD28_MASK) >> LCD_WF8B_BPELCD28_SHIFT)
#define LCD_BRD_WF8B_BPELCD28(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD28_SHIFT))

