RT-Thread/rt-thread/bsp/freescale/platform/devices/MK51D10/include/MK51D10_extension.h
/*! @brief Set the BPHLCD17 field to a new value. */
#define LCD_WR_WF8B_BPHLCD17(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD17_MASK, LCD_WF8B_BPHLCD17(value)))
#define LCD_BWR_WF8B_BPHLCD17(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD17_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD16[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD16 field. */
#define LCD_RD_WF8B_BPHLCD16(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD16_MASK) >> LCD_WF8B_BPHLCD16_SHIFT)
#define LCD_BRD_WF8B_BPHLCD16(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD16_SHIFT))

/*! @brief Set the BPHLCD16 field to a new value. */
#define LCD_WR_WF8B_BPHLCD16(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD16_MASK, LCD_WF8B_BPHLCD16(value)))
#define LCD_BWR_WF8B_BPHLCD16(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD16_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD15[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD15 field. */
#define LCD_RD_WF8B_BPHLCD15(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD15_MASK) >> LCD_WF8B_BPHLCD15_SHIFT)
#define LCD_BRD_WF8B_BPHLCD15(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD15_SHIFT))

/*! @brief Set the BPHLCD15 field to a new value. */
#define LCD_WR_WF8B_BPHLCD15(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD15_MASK, LCD_WF8B_BPHLCD15(value)))
#define LCD_BWR_WF8B_BPHLCD15(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD15_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD6[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD6 field. */
#define LCD_RD_WF8B_BPHLCD6(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD6_MASK) >> LCD_WF8B_BPHLCD6_SHIFT)
#define LCD_BRD_WF8B_BPHLCD6(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD6_SHIFT))

/*! @brief Set the BPHLCD6 field to a new value. */
#define LCD_WR_WF8B_BPHLCD6(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD6_MASK, LCD_WF8B_BPHLCD6(value)))
#define LCD_BWR_WF8B_BPHLCD6(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD14[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD14 field. */
#define LCD_RD_WF8B_BPHLCD14(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD14_MASK) >> LCD_WF8B_BPHLCD14_SHIFT)
#define LCD_BRD_WF8B_BPHLCD14(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD14_SHIFT))

/*! @brief Set the BPHLCD14 field to a new value. */
#define LCD_WR_WF8B_BPHLCD14(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD14_MASK, LCD_WF8B_BPHLCD14(value)))
#define LCD_BWR_WF8B_BPHLCD14(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD14_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD13[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD13 field. */
#define LCD_RD_WF8B_BPHLCD13(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD13_MASK) >> LCD_WF8B_BPHLCD13_SHIFT)
#define LCD_BRD_WF8B_BPHLCD13(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD13_SHIFT))

/*! @brief Set the BPHLCD13 field to a new value. */
#define LCD_WR_WF8B_BPHLCD13(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD13_MASK, LCD_WF8B_BPHLCD13(value)))
#define LCD_BWR_WF8B_BPHLCD13(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD13_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD12[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD12 field. */
#define LCD_RD_WF8B_BPHLCD12(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD12_MASK) >> LCD_WF8B_BPHLCD12_SHIFT)
#define LCD_BRD_WF8B_BPHLCD12(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD12_SHIFT))

/*! @brief Set the BPHLCD12 field to a new value. */
#define LCD_WR_WF8B_BPHLCD12(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD12_MASK, LCD_WF8B_BPHLCD12(value)))
#define LCD_BWR_WF8B_BPHLCD12(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD12_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD11[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD11 field. */
#define LCD_RD_WF8B_BPHLCD11(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD11_MASK) >> LCD_WF8B_BPHLCD11_SHIFT)
#define LCD_BRD_WF8B_BPHLCD11(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD11_SHIFT))

/*! @brief Set the BPHLCD11 field to a new value. */
#define LCD_WR_WF8B_BPHLCD11(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD11_MASK, LCD_WF8B_BPHLCD11(value)))
#define LCD_BWR_WF8B_BPHLCD11(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD11_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD10[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD10 field. */
#define LCD_RD_WF8B_BPHLCD10(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD10_MASK) >> LCD_WF8B_BPHLCD10_SHIFT)
#define LCD_BRD_WF8B_BPHLCD10(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD10_SHIFT))

/*! @brief Set the BPHLCD10 field to a new value. */
#define LCD_WR_WF8B_BPHLCD10(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD10_MASK, LCD_WF8B_BPHLCD10(value)))
#define LCD_BWR_WF8B_BPHLCD10(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD10_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD9[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD9 field. */
#define LCD_RD_WF8B_BPHLCD9(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD9_MASK) >> LCD_WF8B_BPHLCD9_SHIFT)
#define LCD_BRD_WF8B_BPHLCD9(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD9_SHIFT))

/*! @brief Set the BPHLCD9 field to a new value. */
#define LCD_WR_WF8B_BPHLCD9(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD9_MASK, LCD_WF8B_BPHLCD9(value)))
#define LCD_BWR_WF8B_BPHLCD9(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD9_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD8[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD8 field. */
#define LCD_RD_WF8B_BPHLCD8(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD8_MASK) >> LCD_WF8B_BPHLCD8_SHIFT)
#define LCD_BRD_WF8B_BPHLCD8(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD8_SHIFT))

/*! @brief Set the BPHLCD8 field to a new value. */
#define LCD_WR_WF8B_BPHLCD8(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD8_MASK, LCD_WF8B_BPHLCD8(value)))
#define LCD_BWR_WF8B_BPHLCD8(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD8_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD7[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD7 field. */
#define LCD_RD_WF8B_BPHLCD7(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD7_MASK) >> LCD_WF8B_BPHLCD7_SHIFT)
#define LCD_BRD_WF8B_BPHLCD7(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD7_SHIFT))

/*! @brief Set the BPHLCD7 field to a new value. */
#define LCD_WR_WF8B_BPHLCD7(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD7_MASK, LCD_WF8B_BPHLCD7(value)))
#define LCD_BWR_WF8B_BPHLCD7(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD7_SHIFT) = (value))
/*@}*/

/* SLCD */
/* Unified SLCD WF register access macros */
#define LCD_RD_WF8B_BPLCD(base, index, phaseIndex) ((LCD_WF8B_REG((base), (index)) & (1U << (phaseIndex))) >> (phaseIndex))
#define LCD_BRD_WF8B_BPLCD(base, index, phaseIndex) (BME_UBFX8(&LCD_WF8B_REG((base), (index)), (phaseIndex), 1))
#define LCD_WR_WF8B_BPLCD(base, index, phaseIndex, value) (LCD_WF8B_REG((base), (index)) = (LCD_WF8B_REG((base), (index)) & ~(1U << (phaseIndex))) | ((uint32_t)(value) << (phaseIndex)))
#define LCD_BWR_WF8B_BPLCD(base, index, phaseIndex, value) (BME_BFI8(&LCD_WF8B_REG((base), (index)), ((uint32_t)(value) << (phaseIndex)), (phaseIndex), 1))

