RT-Thread/rt-thread/bsp/freescale/platform/devices/MK51D10/include/MK51D10_extension.h
/*! @brief Set the SRAMLAP field to a new value. */
#define MCM_WR_CR_SRAMLAP(base, value) (MCM_RMW_CR(base, MCM_CR_SRAMLAP_MASK, MCM_CR_SRAMLAP(value)))
#define MCM_BWR_CR_SRAMLAP(base, value) (MCM_WR_CR_SRAMLAP(base, value))
/*@}*/

/*!
 * @name Register MCM_CR, field SRAMLWP[30] (RW)
 *
 * When this bit is set, writes to SRAM_L array generates a bus error.
 */
/*@{*/
/*! @brief Read current value of the MCM_CR_SRAMLWP field. */
#define MCM_RD_CR_SRAMLWP(base) ((MCM_CR_REG(base) & MCM_CR_SRAMLWP_MASK) >> MCM_CR_SRAMLWP_SHIFT)
#define MCM_BRD_CR_SRAMLWP(base) (MCM_RD_CR_SRAMLWP(base))

/*! @brief Set the SRAMLWP field to a new value. */
#define MCM_WR_CR_SRAMLWP(base, value) (MCM_RMW_CR(base, MCM_CR_SRAMLWP_MASK, MCM_CR_SRAMLWP(value)))
#define MCM_BWR_CR_SRAMLWP(base, value) (MCM_WR_CR_SRAMLWP(base, value))
/*@}*/

/*******************************************************************************
 * MCM_ISR - Interrupt Status Register
 ******************************************************************************/

/*!
 * @brief MCM_ISR - Interrupt Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire MCM_ISR register
 */
/*@{*/
#define MCM_RD_ISR(base)         (MCM_ISR_REG(base))
#define MCM_WR_ISR(base, value)  (MCM_ISR_REG(base) = (value))
#define MCM_RMW_ISR(base, mask, value) (MCM_WR_ISR(base, (MCM_RD_ISR(base) & ~(mask)) | (value)))
#define MCM_SET_ISR(base, value) (MCM_WR_ISR(base, MCM_RD_ISR(base) |  (value)))
#define MCM_CLR_ISR(base, value) (MCM_WR_ISR(base, MCM_RD_ISR(base) & ~(value)))
#define MCM_TOG_ISR(base, value) (MCM_WR_ISR(base, MCM_RD_ISR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_ISR bitfields
 */

/*!
 * @name Register MCM_ISR, field IRQ[1] (W1C)
 *
 * If ETBCC[RSPT] is set to 01b, this bit is set when the ETB counter expires.
 *
 * Values:
 * - 0b0 - No pending interrupt
 * - 0b1 - Due to the ETB counter expiring, a normal interrupt is pending
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_IRQ field. */
#define MCM_RD_ISR_IRQ(base) ((MCM_ISR_REG(base) & MCM_ISR_IRQ_MASK) >> MCM_ISR_IRQ_SHIFT)
#define MCM_BRD_ISR_IRQ(base) (MCM_RD_ISR_IRQ(base))

/*! @brief Set the IRQ field to a new value. */
#define MCM_WR_ISR_IRQ(base, value) (MCM_RMW_ISR(base, (MCM_ISR_IRQ_MASK | MCM_ISR_NMI_MASK), MCM_ISR_IRQ(value)))
#define MCM_BWR_ISR_IRQ(base, value) (MCM_WR_ISR_IRQ(base, value))
/*@}*/

/*!
 * @name Register MCM_ISR, field NMI[2] (W1C)
 *
 * If ETBCC[RSPT] is set to 10b, this bit is set when the ETB counter expires.
 *
 * Values:
 * - 0b0 - No pending NMI
 * - 0b1 - Due to the ETB counter expiring, an NMI is pending
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_NMI field. */
#define MCM_RD_ISR_NMI(base) ((MCM_ISR_REG(base) & MCM_ISR_NMI_MASK) >> MCM_ISR_NMI_SHIFT)
#define MCM_BRD_ISR_NMI(base) (MCM_RD_ISR_NMI(base))

/*! @brief Set the NMI field to a new value. */
#define MCM_WR_ISR_NMI(base, value) (MCM_RMW_ISR(base, (MCM_ISR_NMI_MASK | MCM_ISR_IRQ_MASK), MCM_ISR_NMI(value)))
#define MCM_BWR_ISR_NMI(base, value) (MCM_WR_ISR_NMI(base, value))
/*@}*/

/*!
 * @name Register MCM_ISR, field DHREQ[3] (RO)
 *
 * Indicates that a debug halt request is initiated due to a ETB counter
 * expiration, ETBCC[2:0] = 3b111 & ETBCV[10:0] = 11h0. This bit is cleared when the
 * counter is disabled or when the ETB counter is reloaded.
 *
 * Values:
 * - 0b0 - No debug halt request
 * - 0b1 - Debug halt request initiated
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_DHREQ field. */
#define MCM_RD_ISR_DHREQ(base) ((MCM_ISR_REG(base) & MCM_ISR_DHREQ_MASK) >> MCM_ISR_DHREQ_SHIFT)
#define MCM_BRD_ISR_DHREQ(base) (MCM_RD_ISR_DHREQ(base))
/*@}*/

/*******************************************************************************
 * MCM_ETBCC - ETB Counter Control register
 ******************************************************************************/

/*!
 * @brief MCM_ETBCC - ETB Counter Control register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire MCM_ETBCC register
 */
/*@{*/
#define MCM_RD_ETBCC(base)       (MCM_ETBCC_REG(base))
#define MCM_WR_ETBCC(base, value) (MCM_ETBCC_REG(base) = (value))
#define MCM_RMW_ETBCC(base, mask, value) (MCM_WR_ETBCC(base, (MCM_RD_ETBCC(base) & ~(mask)) | (value)))
#define MCM_SET_ETBCC(base, value) (MCM_WR_ETBCC(base, MCM_RD_ETBCC(base) |  (value)))
#define MCM_CLR_ETBCC(base, value) (MCM_WR_ETBCC(base, MCM_RD_ETBCC(base) & ~(value)))
#define MCM_TOG_ETBCC(base, value) (MCM_WR_ETBCC(base, MCM_RD_ETBCC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_ETBCC bitfields
 */

/*!
 * @name Register MCM_ETBCC, field CNTEN[0] (RW)
 *
 * Enables the ETB counter.
 *
 * Values:
 * - 0b0 - ETB counter disabled
 * - 0b1 - ETB counter enabled
 */
/*@{*/
/*! @brief Read current value of the MCM_ETBCC_CNTEN field. */
#define MCM_RD_ETBCC_CNTEN(base) ((MCM_ETBCC_REG(base) & MCM_ETBCC_CNTEN_MASK) >> MCM_ETBCC_CNTEN_SHIFT)
#define MCM_BRD_ETBCC_CNTEN(base) (MCM_RD_ETBCC_CNTEN(base))

/*! @brief Set the CNTEN field to a new value. */
#define MCM_WR_ETBCC_CNTEN(base, value) (MCM_RMW_ETBCC(base, MCM_ETBCC_CNTEN_MASK, MCM_ETBCC_CNTEN(value)))
#define MCM_BWR_ETBCC_CNTEN(base, value) (MCM_WR_ETBCC_CNTEN(base, value))
/*@}*/

/*!
 * @name Register MCM_ETBCC, field RSPT[2:1] (RW)
 *
 * Values:
 * - 0b00 - No response when the ETB count expires
 * - 0b01 - Generate a normal interrupt when the ETB count expires
 * - 0b10 - Generate an NMI when the ETB count expires
 * - 0b11 - Generate a debug halt when the ETB count expires
 */
/*@{*/
/*! @brief Read current value of the MCM_ETBCC_RSPT field. */
#define MCM_RD_ETBCC_RSPT(base) ((MCM_ETBCC_REG(base) & MCM_ETBCC_RSPT_MASK) >> MCM_ETBCC_RSPT_SHIFT)
#define MCM_BRD_ETBCC_RSPT(base) (MCM_RD_ETBCC_RSPT(base))

/*! @brief Set the RSPT field to a new value. */
#define MCM_WR_ETBCC_RSPT(base, value) (MCM_RMW_ETBCC(base, MCM_ETBCC_RSPT_MASK, MCM_ETBCC_RSPT(value)))
#define MCM_BWR_ETBCC_RSPT(base, value) (MCM_WR_ETBCC_RSPT(base, value))
/*@}*/

/*!
 * @name Register MCM_ETBCC, field RLRQ[3] (RW)
 *
 * Reloads the ETB packet counter with the MCM_ETBRL RELOAD value. If IRQ or NMI
 * interrupts were enabled and an NMI or IRQ interrupt was generated on counter
 * expiration, setting this bit clears the pending NMI or IRQ interrupt request.
 * If debug halt was enabled and a debug halt request was asserted on counter
 * expiration, setting this bit clears the debug halt request.
 *
 * Values:
 * - 0b0 - No effect
 * - 0b1 - Clears pending debug halt, NMI, or IRQ interrupt requests
 */
/*@{*/
/*! @brief Read current value of the MCM_ETBCC_RLRQ field. */
#define MCM_RD_ETBCC_RLRQ(base) ((MCM_ETBCC_REG(base) & MCM_ETBCC_RLRQ_MASK) >> MCM_ETBCC_RLRQ_SHIFT)
#define MCM_BRD_ETBCC_RLRQ(base) (MCM_RD_ETBCC_RLRQ(base))

/*! @brief Set the RLRQ field to a new value. */
#define MCM_WR_ETBCC_RLRQ(base, value) (MCM_RMW_ETBCC(base, MCM_ETBCC_RLRQ_MASK, MCM_ETBCC_RLRQ(value)))
#define MCM_BWR_ETBCC_RLRQ(base, value) (MCM_WR_ETBCC_RLRQ(base, value))
/*@}*/

/*!
 * @name Register MCM_ETBCC, field ETDIS[4] (RW)
 *
 * Disables the trace path from ETM to TPIU.
 *
 * Values:
 * - 0b0 - ETM-to-TPIU trace path enabled
 * - 0b1 - ETM-to-TPIU trace path disabled
 */
/*@{*/
/*! @brief Read current value of the MCM_ETBCC_ETDIS field. */
#define MCM_RD_ETBCC_ETDIS(base) ((MCM_ETBCC_REG(base) & MCM_ETBCC_ETDIS_MASK) >> MCM_ETBCC_ETDIS_SHIFT)
#define MCM_BRD_ETBCC_ETDIS(base) (MCM_RD_ETBCC_ETDIS(base))

