RT-Thread/rt-thread/bsp/freescale/platform/devices/MK51D10/include/MK51D10_extension.h
/*
 * Constants & macros for individual OPAMP_C0 bitfields
 */

/*!
 * @name Register OPAMP_C0, field MODE[1:0] (RW)
 *
 * Values:
 * - 0b00 - Buffer
 * - 0b10 - General-purpose
 * - 0bx1 - Programmable gain
 */
/*@{*/
/*! @brief Read current value of the OPAMP_C0_MODE field. */
#define OPAMP_RD_C0_MODE(base) ((OPAMP_C0_REG(base) & OPAMP_C0_MODE_MASK) >> OPAMP_C0_MODE_SHIFT)
#define OPAMP_BRD_C0_MODE(base) (OPAMP_RD_C0_MODE(base))

/*! @brief Set the MODE field to a new value. */
#define OPAMP_WR_C0_MODE(base, value) (OPAMP_RMW_C0(base, OPAMP_C0_MODE_MASK, OPAMP_C0_MODE(value)))
#define OPAMP_BWR_C0_MODE(base, value) (OPAMP_WR_C0_MODE(base, value))
/*@}*/

/*!
 * @name Register OPAMP_C0, field LPEN[6] (RW)
 *
 * See the OPAMP electrical specifications in the device data sheet for details
 * on the impact of the modes below.
 *
 * Values:
 * - 0b0 - High-Speed mode selected. In this mode, OPAMP has faster slew rate
 *     and unity gain bandwidth performance with higher current consumption.
 * - 0b1 - Low-Power mode selected. In this mode, OPAMP has lower current
 *     consumption with slower slew rate and unity gain bandwidth performance.
 */
/*@{*/
/*! @brief Read current value of the OPAMP_C0_LPEN field. */
#define OPAMP_RD_C0_LPEN(base) ((OPAMP_C0_REG(base) & OPAMP_C0_LPEN_MASK) >> OPAMP_C0_LPEN_SHIFT)
#define OPAMP_BRD_C0_LPEN(base) (BITBAND_ACCESS8(&OPAMP_C0_REG(base), OPAMP_C0_LPEN_SHIFT))

/*! @brief Set the LPEN field to a new value. */
#define OPAMP_WR_C0_LPEN(base, value) (OPAMP_RMW_C0(base, OPAMP_C0_LPEN_MASK, OPAMP_C0_LPEN(value)))
#define OPAMP_BWR_C0_LPEN(base, value) (BITBAND_ACCESS8(&OPAMP_C0_REG(base), OPAMP_C0_LPEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register OPAMP_C0, field EN[7] (RW)
 *
 * Values:
 * - 0b0 - OPAMP is disabled and not powered.
 * - 0b1 - OPAMP is enabled and powered.
 */
/*@{*/
/*! @brief Read current value of the OPAMP_C0_EN field. */
#define OPAMP_RD_C0_EN(base) ((OPAMP_C0_REG(base) & OPAMP_C0_EN_MASK) >> OPAMP_C0_EN_SHIFT)
#define OPAMP_BRD_C0_EN(base) (BITBAND_ACCESS8(&OPAMP_C0_REG(base), OPAMP_C0_EN_SHIFT))

/*! @brief Set the EN field to a new value. */
#define OPAMP_WR_C0_EN(base, value) (OPAMP_RMW_C0(base, OPAMP_C0_EN_MASK, OPAMP_C0_EN(value)))
#define OPAMP_BWR_C0_EN(base, value) (BITBAND_ACCESS8(&OPAMP_C0_REG(base), OPAMP_C0_EN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * OPAMP_C1 - Control Register 1
 ******************************************************************************/

/*!
 * @brief OPAMP_C1 - Control Register 1 (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire OPAMP_C1 register
 */
/*@{*/
#define OPAMP_RD_C1(base)        (OPAMP_C1_REG(base))
#define OPAMP_WR_C1(base, value) (OPAMP_C1_REG(base) = (value))
#define OPAMP_RMW_C1(base, mask, value) (OPAMP_WR_C1(base, (OPAMP_RD_C1(base) & ~(mask)) | (value)))
#define OPAMP_SET_C1(base, value) (OPAMP_WR_C1(base, OPAMP_RD_C1(base) |  (value)))
#define OPAMP_CLR_C1(base, value) (OPAMP_WR_C1(base, OPAMP_RD_C1(base) & ~(value)))
#define OPAMP_TOG_C1(base, value) (OPAMP_WR_C1(base, OPAMP_RD_C1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual OPAMP_C1 bitfields
 */

/*!
 * @name Register OPAMP_C1, field AMPRI[1:0] (RW)
 *
 * See Table 1, "Operating Modes" in Operating modes for valid field encodings.
 */
/*@{*/
/*! @brief Read current value of the OPAMP_C1_AMPRI field. */
#define OPAMP_RD_C1_AMPRI(base) ((OPAMP_C1_REG(base) & OPAMP_C1_AMPRI_MASK) >> OPAMP_C1_AMPRI_SHIFT)
#define OPAMP_BRD_C1_AMPRI(base) (OPAMP_RD_C1_AMPRI(base))

/*! @brief Set the AMPRI field to a new value. */
#define OPAMP_WR_C1_AMPRI(base, value) (OPAMP_RMW_C1(base, OPAMP_C1_AMPRI_MASK, OPAMP_C1_AMPRI(value)))
#define OPAMP_BWR_C1_AMPRI(base, value) (OPAMP_WR_C1_AMPRI(base, value))
/*@}*/

/*!
 * @name Register OPAMP_C1, field AMPRF[4:2] (RW)
 *
 * See Table 1, "Operating Modes" in Operating modes for valid field encodings.
 */
/*@{*/
/*! @brief Read current value of the OPAMP_C1_AMPRF field. */
#define OPAMP_RD_C1_AMPRF(base) ((OPAMP_C1_REG(base) & OPAMP_C1_AMPRF_MASK) >> OPAMP_C1_AMPRF_SHIFT)
#define OPAMP_BRD_C1_AMPRF(base) (OPAMP_RD_C1_AMPRF(base))

/*! @brief Set the AMPRF field to a new value. */
#define OPAMP_WR_C1_AMPRF(base, value) (OPAMP_RMW_C1(base, OPAMP_C1_AMPRF_MASK, OPAMP_C1_AMPRF(value)))
#define OPAMP_BWR_C1_AMPRF(base, value) (OPAMP_WR_C1_AMPRF(base, value))
/*@}*/

/*******************************************************************************
 * OPAMP_C2 - Control Register 2
 ******************************************************************************/

/*!
 * @brief OPAMP_C2 - Control Register 2 (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire OPAMP_C2 register
 */
/*@{*/
#define OPAMP_RD_C2(base)        (OPAMP_C2_REG(base))
#define OPAMP_WR_C2(base, value) (OPAMP_C2_REG(base) = (value))
#define OPAMP_RMW_C2(base, mask, value) (OPAMP_WR_C2(base, (OPAMP_RD_C2(base) & ~(mask)) | (value)))
#define OPAMP_SET_C2(base, value) (OPAMP_WR_C2(base, OPAMP_RD_C2(base) |  (value)))
#define OPAMP_CLR_C2(base, value) (OPAMP_WR_C2(base, OPAMP_RD_C2(base) & ~(value)))
#define OPAMP_TOG_C2(base, value) (OPAMP_WR_C2(base, OPAMP_RD_C2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual OPAMP_C2 bitfields
 */

/*!
 * @name Register OPAMP_C2, field AMPNSEL[2:0] (RW)
 *
 * Selects the negative input. The input connections vary by device. See the
 * chip configuration details for information on the connections to these inputs.
 *
 * Values:
 * - 0b000 - Negative input 0
 * - 0b001 - Negative input 1
 * - 0b010 - Negative input 2
 * - 0b011 - Negative input 3
 * - 0b100 - Negative input 4
 * - 0b101 - Negative input 5
 * - 0b110 - Negative input 6
 * - 0b111 - Negative input 7
 */
/*@{*/
/*! @brief Read current value of the OPAMP_C2_AMPNSEL field. */
#define OPAMP_RD_C2_AMPNSEL(base) ((OPAMP_C2_REG(base) & OPAMP_C2_AMPNSEL_MASK) >> OPAMP_C2_AMPNSEL_SHIFT)
#define OPAMP_BRD_C2_AMPNSEL(base) (OPAMP_RD_C2_AMPNSEL(base))

/*! @brief Set the AMPNSEL field to a new value. */
#define OPAMP_WR_C2_AMPNSEL(base, value) (OPAMP_RMW_C2(base, OPAMP_C2_AMPNSEL_MASK, OPAMP_C2_AMPNSEL(value)))
#define OPAMP_BWR_C2_AMPNSEL(base, value) (OPAMP_WR_C2_AMPNSEL(base, value))
/*@}*/

/*!
 * @name Register OPAMP_C2, field AMPPSEL[6:4] (RW)
 *
 * Selects the positive input. The input connections vary by device. See the
 * chip configuration details for information on the connections to these inputs.
 *
 * Values:
 * - 0b000 - Positive input 0
 * - 0b001 - Positive input 1
 * - 0b010 - Positive input 2
 * - 0b011 - Positive input 3
 * - 0b100 - Positive input 4
 * - 0b101 - Positive input 5
 * - 0b110 - Positive input 6
 * - 0b111 - Positive input 7
 */
/*@{*/
/*! @brief Read current value of the OPAMP_C2_AMPPSEL field. */
#define OPAMP_RD_C2_AMPPSEL(base) ((OPAMP_C2_REG(base) & OPAMP_C2_AMPPSEL_MASK) >> OPAMP_C2_AMPPSEL_SHIFT)
#define OPAMP_BRD_C2_AMPPSEL(base) (OPAMP_RD_C2_AMPPSEL(base))

/*! @brief Set the AMPPSEL field to a new value. */
#define OPAMP_WR_C2_AMPPSEL(base, value) (OPAMP_RMW_C2(base, OPAMP_C2_AMPPSEL_MASK, OPAMP_C2_AMPPSEL(value)))
#define OPAMP_BWR_C2_AMPPSEL(base, value) (OPAMP_WR_C2_AMPPSEL(base, value))
/*@}*/

